aethaniel/emBlocks_sam_patch/share/em_armgcc/lib/atmel/atsam3/atsam3u/include/atsam3u2e.h
/* ---------------------------------------------------------------------------- */
/*                  Atmel Microcontroller Software Support                      */
/*                       SAM Software Package License                           */
/* ---------------------------------------------------------------------------- */
/* Copyright (c) 2013, Atmel Corporation                                        */
/*                                                                              */
/* All rights reserved.                                                         */
/*                                                                              */
/* Redistribution and use in source and binary forms, with or without           */
/* modification, are permitted provided that the following condition is met:    */
/*                                                                              */
/* - Redistributions of source code must retain the above copyright notice,     */
/* this list of conditions and the disclaimer below.                            */
/*                                                                              */
/* Atmel's name may not be used to endorse or promote products derived from     */
/* this software without specific prior written permission.                     */
/*                                                                              */
/* DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR   */
/* IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF */
/* MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE   */
/* DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,      */
/* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT */
/* LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,  */
/* OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF    */
/* LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING         */
/* NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, */
/* EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                           */
/* ---------------------------------------------------------------------------- */

#ifndef _SAM3U2E_
#define _SAM3U2E_

/** \addtogroup SAM3U2E_definitions SAM3U2E definitions
  This file defines all structures and symbols for SAM3U2E:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
*/
/*@{*/

#ifdef __cplusplus
 extern "C" {
#endif

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#include <stdint.h>
#endif

/* ************************************************************************** */
/*   CMSIS DEFINITIONS FOR SAM3U2E */
/* ************************************************************************** */
/** \addtogroup SAM3U2E_cmsis CMSIS Definitions */
/*@{*/

/**< Interrupt Number Definition */
typedef enum IRQn
{
/******  Cortex-M3 Processor Exceptions Numbers ******************************/
  NonMaskableInt_IRQn   = -14, /**<  2 Non Maskable Interrupt                */
  HardFault_IRQn        = -13, /**<  3 Cortex-M3 Hard Fault Interrupt        */
  MemoryManagement_IRQn = -12, /**<  4 Cortex-M3 Memory Management Interrupt */
  BusFault_IRQn         = -11, /**<  5 Cortex-M3 Bus Fault Interrupt         */
  UsageFault_IRQn       = -10, /**<  6 Cortex-M3 Usage Fault Interrupt       */
  SVCall_IRQn           = -5,  /**< 11 Cortex-M3 SV Call Interrupt           */
  DebugMonitor_IRQn     = -4,  /**< 12 Cortex-M3 Debug Monitor Interrupt     */
  PendSV_IRQn           = -2,  /**< 14 Cortex-M3 Pend SV Interrupt           */
  SysTick_IRQn          = -1,  /**< 15 Cortex-M3 System Tick Interrupt       */
/******  SAM3U2E specific Interrupt Numbers *********************************/

  SUPC_IRQn            =  0, /**<  0 SAM3U2E Supply Controller (SUPC) */
  RSTC_IRQn            =  1, /**<  1 SAM3U2E Reset Controller (RSTC) */
  RTC_IRQn             =  2, /**<  2 SAM3U2E Real Time Clock (RTC) */
  RTT_IRQn             =  3, /**<  3 SAM3U2E Real Time Timer (RTT) */
  WDT_IRQn             =  4, /**<  4 SAM3U2E Watchdog Timer (WDT) */
  PMC_IRQn             =  5, /**<  5 SAM3U2E Power Management Controller (PMC) */
  EFC0_IRQn            =  6, /**<  6 SAM3U2E Enhanced Embedded Flash Controller 0 (EFC0) */
  UART_IRQn            =  8, /**<  8 SAM3U2E Universal Asynchronous Receiver Transmitter (UART) */
  PIOA_IRQn            = 10, /**< 10 SAM3U2E Parallel I/O Controller A, (PIOA) */
  PIOB_IRQn            = 11, /**< 11 SAM3U2E Parallel I/O Controller B (PIOB) */
  PIOC_IRQn            = 12, /**< 12 SAM3U2E Parallel I/O Controller C (PIOC) */
  USART0_IRQn          = 13, /**< 13 SAM3U2E USART 0 (USART0) */
  USART1_IRQn          = 14, /**< 14 SAM3U2E USART 1 (USART1) */
  USART2_IRQn          = 15, /**< 15 SAM3U2E USART 2 (USART2) */
  USART3_IRQn          = 16, /**< 16 SAM3U2E USART 3 (USART3) */
  HSMCI_IRQn           = 17, /**< 17 SAM3U2E High Speed Multimedia Card Interface (HSMCI) */
  TWI0_IRQn            = 18, /**< 18 SAM3U2E Two-Wire Interface 0 (TWI0) */
  TWI1_IRQn            = 19, /**< 19 SAM3U2E Two-Wire Interface 1 (TWI1) */
  SPI_IRQn             = 20, /**< 20 SAM3U2E Serial Peripheral Interface (SPI) */
  SSC_IRQn             = 21, /**< 21 SAM3U2E Synchronous Serial Controller (SSC) */
  TC0_IRQn             = 22, /**< 22 SAM3U2E Timer Counter 0 (TC0) */
  TC1_IRQn             = 23, /**< 23 SAM3U2E Timer Counter 1 (TC1) */
  TC2_IRQn             = 24, /**< 24 SAM3U2E Timer Counter 2 (TC2) */
  PWM_IRQn             = 25, /**< 25 SAM3U2E Pulse Width Modulation Controller (PWM) */
  ADC12B_IRQn          = 26, /**< 26 SAM3U2E 12-bit ADC Controller (ADC12B) */
  ADC_IRQn             = 27, /**< 27 SAM3U2E 10-bit ADC Controller (ADC) */
  DMAC_IRQn            = 28, /**< 28 SAM3U2E DMA Controller (DMAC) */
  UDPHS_IRQn           = 29, /**< 29 SAM3U2E USB Device High Speed (UDPHS) */

